/*
 * StructDef.h
 *
 *  Created on: 22 במרץ 2025
 *      Author: Yahali
 */

#ifndef DRIVERS_APPLICATION_STRUCTDEF_H_
#define DRIVERS_APPLICATION_STRUCTDEF_H_

#include <math.h>
#include <stdio.h>


#include "f28x_project.h"
#include "..\device_support\f28p65x\common\include\driverlib.h"
#include "..\device_support\f28p65x\common\include\device.h"

#ifdef VARS_OWNER
#define EXTERN_TAG
#pragma DATA_SECTION(ClaRecsCopy, ".data"); // Assure in DMA-accesible RAM
#else
#define EXTERN_TAG extern
#endif

#include "ConstDef.h"
#include "CanStruct.h"
#include "BITTimerAlloc.h"
#include "TimerArr.h"
#include "WhoIsThisProject.h"

#include "Revisions.h"
#include "HwConfig.h"
#include "ProjControlPars.h"
#include "Estimator.h"

#include "..\Recorder\Recorder.h"
#include "..\Control\ClaDefs.h"
#include "Revisions.h"
#include "..\Control\TrapezeProfiler.h"
#include "..\Drivers\EEPROM_Config.h"
#include "..\Core2Interface\S2MM2S.h"

// Byte  0:1 Control word. Thats: .0: motor on, 1: Fault reset, :2..4: Loop type : 5..7: Reference type
// Bytes 2..3 : Current limit, 10mAmp units
// Bytes 4..7: Command

struct CControlWord
{
    int unsigned MotorOn : 1 ;
    int unsigned FaultReset : 1 ;
    int unsigned LoopType  : 3 ;
    int unsigned RefType   : 3 ;
    int unsigned Reserved  : 4 ;
};

union UControlWord
{
    struct CControlWord CWord ;
    short  unsigned us ;
};

struct CPDO1Rx
{
    union UControlWord UCWord ;
    short unsigned CurLimit10mAmp   ;
    float Command ;
};

union UPDO1Rx
{
    struct CPDO1Rx PDO1Rx ;
    long unsigned ul[2] ;
    short unsigned us[4] ;
    short s[4] ;
    float f[2] ;
};



union UPDO2Rx
{
    float f[2] ;
    long unsigned ul[2] ;
    short unsigned us[4] ;
};


struct CFlashProg
{
    long PassWord ; // !< Must be 0x12345678 to work
    long unsigned AddressInFlash ; // !< Address in flash
    short unsigned InternalBufOffset ;
};
EXTERN_TAG struct CFlashProg  FlashProg ;

struct CTiming
{
    float Ts ;
    float TsTraj  ; // Sampling time for trajectory calculations
    float OneOverTsTraj  ; // 1/Sampling time for trajectory calculations
    long  unsigned ClocksOfInt ;
    long  unsigned LmeasClocksOfInt ;
    long unsigned UsecTimer ;
    long unsigned IntCntr ;
    short unsigned TsInTicks ;
    short unsigned PwmFrame ;
    float AutoCommandAge ;
};


struct CPosControl
{
    float PosReference  ; // !< Reference to the position controller
    float PosFeedBack   ; // !< Feedback for position control
    float PosError      ;
    float PosErrorR      ; // !< Realized pos error, after dead band consideration
    float SpeedLimitedPosReference ;
    float FilteredPosReference ;
    short DeadZoneState ; // 0 if in dead zone
    float PosErrorExt    ;
    float SpeedFFExt     ;
    float SpeedFFExtState     ;
    long unsigned RefTimer   ;
};

struct CSpeedControl
{
    float ProfileAcceleration    ; // !< Profiled acceleration to Target to the speed controller
    float SpeedTarget    ; // !< Target to the speed controller
    float SpeedReference ; // !< Reference to the speed controller
    float SpeedCommand   ; // !< Command to the speed controller composed of Reference and of position corrections
    float SpeedError     ; // !< Error of speed from command
    float PIState        ; // !< State of PI controller
    float PiOut          ; // !< Output of PI controller
};

//struct CCurrentControl
//{
//    short unsigned bInCurrentRefLimit ; // 1 if current reference is limited
//};


struct CVoltageControl
{
    float VoltageReference ;
    float MaxVoltage ;
    float VoltageCommands[3] ;
};


struct CRtBit
{
    float I2tInt  ; // I2t RT integrator
    float I2tState ; // State of I2t
    short unsigned I2tIntegrationCount ;  // I2t integrator counter
};



struct CAnalogProc
{
    float FiltCurAdcOffsetRef[3] ;
    float FiltCurAdcOffset[3] ;
    float Temperature ;
    short unsigned bOffsetCalculated ;
};


struct COuterSensor
{
    union
    {
        long l ;
        short unsigned us[2] ;
        short s[2] ;
        unsigned long ul ;
    }OuterPosInt ;
    float PotValue ;
    float OuterPos ;
    float OuterMerge ;
    float OuterMergeState ;
    float OuterMergeCst ;
};


struct CMCanSupport
{
    long unsigned  *pFifo0Start ;
    short unsigned Fifo0ElementWidth ;
    short unsigned Fifo0NumElements ; // Must be 2^N
    long unsigned  *pTxBufStart ;
    short unsigned TxBufElementWidth ;
    short unsigned TxNumElements ; // Must be 2^N
    union UPDO1Rx uPDO1Rx ;
    union UPDO2Rx uPDO2Rx ;
    union UPDO2Rx uNMTRx  ;
    union
    {
        unsigned long  long ll ;
        long unsigned ul[2] ;
    } Pdo1RxTime ;
    //long unsigned SyncTrackTime ;
    float MaxInterMessage ;
    float NomInterMessageTime ;
    float OneOverNomInterMessageTime ;
    float MinInterMessage ;
    float LastInterMessageTime ;
    float InterMessageTime ;
    //long  Usec4Sync  ;
    //long  Usec4ThisMessage ;
    //float Usec4ThisMessageDebt ;
    float OneOverActMessageTime ;
    float OneOverNomMessageTime ;
    //short unsigned SyncValid ;
    short unsigned PdoDirtyBoard ;
    short unsigned InBufCounter  ;
    short unsigned NodeStopped  ;
    short unsigned bAutoBlocked ;
};



#define CBIT_MOTOR_ON_MASK 1
#define CBIT_MOTOR_ON_SHIFTS 0
#define CBIT_MOTOR_READY_MASK 2
#define CBIT_MOTOR_READY_SHIFTS 1
#define CBIT_STO_EVT_MASK 4
#define CBIT_STO_EVT_SHIFTS 2
#define CBIT_PROFILE_CONVERGED_MASK 8
#define CBIT_PROFILE_CONVERGED_SHIFTS 3
#define CBIT_MOTION_CONVERGED_MASK 16
#define CBIT_MOTION_CONVERGED_SHIFTS 4
#define CBIT_MOTION_FAULT_MASK 32
#define CBIT_MOTION_FAULT_SHIFTS 5
#define CBIT_QUICK_STOP_MASK 64
#define CBIT_QUICK_STOP_SHIFTS 6
#define CBIT_BRAKE_RELEASE_MASK 128
#define CBIT_BRAKE_RELEASE_SHIFTS 7
#define CBIT_POT_REF_FAIL_MASK 256
#define CBIT_POT_REF_FAIL_SHIFTS 8
#define CBIT_LOOP_CLOSURE_MASK 0xE00
#define CBIT_LOOP_CLOSURE_SHIFTS 9
#define CBIT_SYSTEM_MODE_MASK 0x7000
#define CBIT_SYSTEM_MODE_SHIFTS 12
#define CBIT_CURRENT_LIMIT_MASK 0x8000
#define CBIT_CURRENT_LIMIT_SHIFTS 15

#define CBIT_NO_CALIB_MASK 0x10000
#define CBIT_NO_CALIB_SHIFTS 16
#define CBIT_GYRO_NOT_READY_MASK 0x20000
#define CBIT_GYRO_NOT_READY_SHIFTS 17
#define CBIT_REC_WAIT_TRIGGER_MASK 0x40000
#define CBIT_REC_WAIT_TRIGGER_SHIFTS 18
#define CBIT_REC_ACTIVE_MASK 0x80000
#define CBIT_REC_ACTIVE_SHIFTS 19
#define CBIT_REC_READY_MASK 0x100000
#define CBIT_REC_READY_SHIFTS 20
#define CBIT_G_REFGEN_ON_MASK 0x200000
#define CBIT_G_REFGEN_ON_SHIFTS 21
#define CBIT_T_REFGEN_ON_MASK 0x400000
#define CBIT_T_REFGEN_ON_SHIFTS 22
#define CBIT_T_AXIS  23 // 24 and 25 also
#define CBIT_T_AXIS_MASK 0x7800000



struct CCBit
{
    int unsigned MotorOn    : 1 ; //0
    int unsigned MotorReady : 1 ; // 1
    int unsigned StoEvent   : 1 ; // 2!< Braking in anticipation for disable by STO
    int unsigned ProfileConverged : 1 ; //3 !< Indication that profile has converged
    int unsigned MotionConverged : 1 ; //4 !< Indication that motion tracks with desired precision
    int unsigned MotorFault : 1 ;//5
    int unsigned QuickStop : 1 ;//6
    int unsigned BrakesReleaseCmd : 1 ; //7
    int unsigned PotRefFail : 1 ; // 8 Failure of potentiometer reference voltage
    int unsigned LoopClosureMode : 3 ; // 9-11
    int unsigned SystemMode : 3 ; //12-14
    int unsigned CurrentLimit : 1 ;//15
    int unsigned NoCalib : 1 ; // 16 Calib failure
    int unsigned GyroNotReady : 1 ; // 17 Gyro still calibrates its offset
    int unsigned RecorderWaitTrigger : 1 ; //18
    int unsigned RecorderActive : 1 ; // 19
    int unsigned RecorderReady  : 1 ; // 20
    int unsigned RefGenOn  : 1 ; //21
    int unsigned TRefGenOn  : 1 ; //22
    int unsigned IsTemperature : 1 ; //23
    int unsigned ReferenceMode      : 3 ; //24-26
    int unsigned Pdo3IsPotDiff : 1 ; // 27
    int unsigned Configured      : 1 ; // 28
    int unsigned Homed : 1 ; // 29
    int unsigned Din1 : 1 ; // 30
    int unsigned Din2 : 1 ; //31
};


struct CCBitCpu2
{
    int unsigned Cpu2HadWatchdogReset: 1 ;
    int unsigned Spare: 15 ;
};


union UCBit
{
    struct CCBit  bit ;
    long unsigned all ;
    short unsigned us[2] ;
};

#define INFINEON_DIAG_MASK (0xff<<3)

struct CCBit2
{
    int unsigned bAutoBlocked : 1 ;
    int unsigned NodeStopped :  1 ;
    int unsigned YobtVoyomat :  1 ;
    int unsigned InfineonFault: 1 ;
    int unsigned IaDiagPhU : 1 ;
    int unsigned UaDiagPhU : 1 ;
    int unsigned IaDiagPhV : 1 ;
    int unsigned UaDiagPhV : 1 ;
    int unsigned IaDiagPhW : 1 ;
    int unsigned UaDiagPhW : 1 ;
    int unsigned IaDiagDc : 1 ;
    int unsigned UaDiagDc : 1 ;
    int unsigned bRsvd : 4 ;
};

union UCBit2
{
    struct CCBit2  bit ;
    short unsigned all ;
    long unsigned  Lall ;
};

union UCBitCpu2
{
    struct CCBitCpu2  bit ;
    short unsigned all ;
    long unsigned  Lall ;
};


struct CRejectWarning
{
    short IgnoreWarning ;
    short unsigned exp ;
